app/Controllers/Libros.php

SELECT *
FROM `libros`
ORDER BY `id` ASC
---
    public function index(){

        $libro= new Libro();
        $datos['libros']= $libro->orderBy('id','ASC')->findAll();

SELECT *
FROM `libros`
WHERE `id` = '8'
 LIMIT 1
---
    public function editar($id=null){

        $libro= new Libro();
        $datos['libro']= $libro->where('id',$id)->first();